/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_process_detail.c                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ttachi <ttachi@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/11/23 08:59:09 by ttachi            #+#    #+#             */
/*   Updated: 2022/11/26 14:46:09 by ttachi           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// #include "ft_printf.h"

// int	ft_process_detail(const char **argv, va_list ap)
// {
// 	int	result;

// 	result = 0;
// 	// ここから条件分岐
// }
